
# yolov26_hybrid_vit_cbam_seg.yaml
nc: 3
ch: 3

backbone:
  - [-1, 1, Conv, [64, 3, 2]]                    # 0
  - [-1, 1, Conv, [128, 3, 2]]                   # 1
  - [-1, 2, C3k2, [256, False, 0.25]]            # 2

  # P3 stride 8
  - [-1, 1, Conv, [256, 3, 2]]                   # 3
  - [-1, 2, C3k2, [512, False, 0.25]]            # 4
  - [-1, 1, CBAM, [512]]                         # 5 <-- Added 512 for 'c' argument

  # P4 stride 16
  - [-1, 1, Conv, [512, 3, 2]]                   # 6
  - [-1, 2, C3k2, [512, True]]                   # 7
  - [-1, 1, CBAM, [512]]                         # 8 <-- Added 512 for 'c' argument

  # P5 stride 32
  - [-1, 1, Conv, [1024, 3, 2]]                  # 9
  - [-1, 2, C3k2, [1024, True]]                  # 10
  - [-1, 1, SPPF, [1024, 5, 3, True]]            # 11
  - [-1, 1, TransformerBlock, [1024, 8, 2]]      # 12 ViT Block

head:
  # Neck fusion
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 13
  - [[-1, 8], 1, Concat, [1]]                    # 14
  - [-1, 2, C3k2, [512, True]]                   # 15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 16
  - [[-1, 5], 1, Concat, [1]]                    # 17
  - [-1, 2, C3k2, [256, True]]                   # 18

  # Instance Segmentation Head - 3 scales (quan trọng)
  - [[18, 15, 12], 1, Segment, [nc, 32, 3]]      # Output từ 3 scale: P3, P4, P5
