# yolov26_hybrid_vit_cbam_seg.yaml  (fixed)
nc: 3
ch: 3

backbone:
  - [-1, 1, Conv, [64, 3, 2]]               # 0  320×320×64
  - [-1, 1, Conv, [128, 3, 2]]              # 1  160×160×128
  - [-1, 2, C3k2, [256, False, 0.25]]       # 2  160×160×256

  # P3 stride 8 → 80×80
  - [-1, 1, Conv, [256, 3, 2]]              # 3
  - [-1, 2, C3k2, [512, False, 0.25]]       # 4
  - [-1, 1, CBAM, [512]]                    # 5  80×80×512

  # P4 stride 16 → 40×40
  - [-1, 1, Conv, [512, 3, 2]]              # 6
  - [-1, 2, C3k2, [512, True]]              # 7
  - [-1, 1, CBAM, [512]]                    # 8  40×40×512

  # P5 stride 32 → 20×20
  - [-1, 1, Conv, [1024, 3, 2]]             # 9
  - [-1, 2, C3k2, [1024, True]]             # 10
  - [-1, 1, SPPF, [1024, 5]]               # 11  ← SỬA: bỏ args thừa
  - [-1, 1, TransformerBlock, [1024, 8, 2]] # 12  20×20×1024 (ViT)

head:
  # ── TOP-DOWN (FPN) ──────────────────────────────
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13  40×40×1024
  - [[-1, 8], 1, Concat, [1]]                   # 14  40×40×1536
  - [-1, 2, C3k2, [512, True]]                  # 15  40×40×512

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 16  80×80×512
  - [[-1, 5], 1, Concat, [1]]                   # 17  80×80×1024
  - [-1, 2, C3k2, [256, True]]                  # 18  80×80×256  (P3-out)

  # ── BOTTOM-UP (PAN) ─────────────────────────────
  - [-1, 1, Conv, [256, 3, 2]]                  # 19  40×40×256
  - [[-1, 15], 1, Concat, [1]]                  # 20  40×40×768
  - [-1, 2, C3k2, [512, True]]                  # 21  40×40×512  (P4-out)

  - [-1, 1, Conv, [512, 3, 2]]                  # 22  20×20×512
  - [[-1, 12], 1, Concat, [1]]                  # 23  20×20×1536
  - [-1, 2, C3k2, [1024, True]]                 # 24  20×20×1024 (P5-out)

  # ── SEGMENT HEAD (3 scales) ──────────────────────
  - [[18, 21, 24], 1, Segment, [nc, 32, 3]]     # 25  P3+P4+P5